// localized port names

"ether"                   = "Ethernet";
"multiether"              = "Ethernet %@";
"pci-ether"               = "PCI Ethernet Slot %@";
"pci-multiether"          = "PCI Ethernet Slot %@, Port %@";
"thunderbolt-ether"       = "Thunderbolt Ethernet Slot %@";
"thunderbolt-multiether"  = "Thunderbolt Ethernet Slot %@, Port %@";
"usb-ether"               = "USB Ethernet (%@)";
"generic-ether"           = "Ethernet Adapter (%@)";

"airport"                 = "Wi-Fi";
"generic-wireless"        = "Wireless Network Adapter (%@)";

"firewire"                = "FireWire";
"pci-firewire"            = "PCI FireWire Slot %@";
"pci-multifirewire"       = "PCI FireWire Slot %@, Port %@";
"thunderbolt-firewire"    = "Thunderbolt FireWire Slot %@";
"thunderbolt-multifirewire" = "Thunderbolt FireWire Slot %@, Port %@";
"generic-firewire"        = "FireWire Adapter (%@)";

"thunderbolt"             = "Thunderbolt";
"multithunderbolt"        = "Thunderbolt %@";
"thunderbolt-bridge"      = "Thunderbolt Bridge";

"bluetooth"               = "Bluetooth DUN";
"bluetooth-modem"         = "USB Bluetooth Modem Adapter";
"bluetooth-modem-port"    = "Bluetooth Modem Port";
"generic-bluetooth-modem" = "Bluetooth Modem (%@)";

"bluetooth-pan-gn"        = "Bluetooth PAN";
"bluetooth-pan-nap"       = "Bluetooth PAN-NAP";
"bluetooth-pan-u"         = "Bluetooth P2P";

"loopback"                = "Loopback";

"modem"                   = "Internal Modem";

"modem-port"              = "Modem Port";
"modem-printer-port"      = "Modem/Printer Port";

"printer-port"            = "Printer Port";
"serial-port"             = "Serial Port";

"usbmodem"                = "USB Modem"; 
"generic-usbmodem"        = "USB Modem (%@)"; 

"wwan"                    = "WWAN"; 

"bond"                    = "Ethernet Bond (%@)";

"bridge"                  = "Bridge (%@)";

"cellular"                = "Cellular (%@)";

"vlan"                    = "VLAN (%@)";

"ipv4"                    = "IPv4";

"l2tp"                    = "L2TP";

"pptp"                    = "PPTP";

"6to4"                    = "6to4";

"ipsec"                   = "IPSec";

"vpn"                     = "VPN (%@)";

// port names (from drivers) that would be good to localize

"AppleTV"                 = "Apple TV USB";

"Display Ethernet"        = "Display Ethernet";
"Display FireWire"        = "Display FireWire";

"External Modem"          = "External Modem";

"iPad"                    = "iPad USB";

"iPhone"                  = "iPhone USB";

"iPod"                    = "iPod USB";

"Thunderbolt Ethernet"    = "Thunderbolt Ethernet";
"Thunderbolt FireWire"    = "Thunderbolt FireWire";

"USB Ethernet"            = "USB Ethernet";
"USB Gigabit Ethernet"    = "USB Gigabit Ethernet";

"Apple USB Ethernet Adapter" = "Apple USB Ethernet Adapter";

// older ("Built-in", HI changed) localizations

"X-airport"               = "AirPort";
"X-ether"                 = "Built-in Ethernet";
"X-multiether"            = "Built-in Ethernet %@";
"X-firewire"              = "Built-in FireWire";
"X-bluetooth"             = "Bluetooth";
"X-iPad"                  = "iPad";
"X-iPhone"                = "iPhone";

// older (non style guide compliant) localizations

"Y-generic-ether"         = "Ethernet Adapter (%@)";
"Y-generic-wireless"      = "Wireless Network Adapter (%@)";
"Y-generic-firewire"      = "FireWire Adapter (%@)";
"Y-bluetooth-modem"       = "USB Bluetooth Modem Adapter";
